app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all.limit(100)

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params) # need username and password.

    if @user.save